app/Models/CategorieModel.php

        public function getcategorie()
        {
            return $this->findAll();
---
SELECT *
FROM `categorie`