app/Models/MarqueModel.php

SELECT *
FROM `marque`
---
        public function getmarque()
        {
            return $this->findAll();