app/Models/ProduitModel.php

SELECT *
FROM `produits`
---
    public function getproduct()
    {
        return $this->findAll();

SELECT *
FROM `produits`
WHERE `produits`.`id` = '0'
---
    public function getoneproduct($id)
    {
        return $this->find($id);