app/Models/RayonModel.php

SELECT *
FROM `rayon`
---
        public function getrayon()
        {
            return $this->findAll();