app/Models/StoreModel.php

        public function getstore($id)
        {
            return $this->where('userid', $id)->first();
---
SELECT *
FROM `store`
WHERE `userid` = '1'
 LIMIT 1

        public function getallstore()
        {
            return $this->findAll();
---
SELECT *
FROM `store`