app/Models/UserModel.php

UPDATE `users` SET `nom` = 'ANDRIAMAHADY', `updatedat` = 'Sun Oct 27 2024'
WHERE `id` = '28'
---
        public function updateinfo()
        {
            $jsonData = json_decode(file_get_contents('php://input'), true);
            // Vérifier si le décodage a réussi
            if ($jsonData === null) {
                http_response_code(400); // Code d'erreur BadRequest
                echo json_encode(['error' => 'Invalid JSON']);
                exit;
            }

            $this->where('id', $jsonData['id'])->set([
                $jsonData['name'] => $jsonData['input'],
                'updatedat' => $jsonData['updatedat'],
            ]);
            $this->update();